In [28]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy.random import randn

In [2]:
ser_a = Series([100,200,300], index = list('abc'))
ser_b = Series([300,400,500,600], index = list('abcd'))

#sum of the series:
ser_a + ser_b

a    400.0
b    600.0
c    800.0
d      NaN
dtype: float64

In [6]:
#The index not present yields a Nan value
#to illustrate in a dataframe
df1 = DataFrame(np.arange(4).reshape(2,2), columns = list('ab'), index
               = list('cd'))
df2 = DataFrame(np.arange(9).reshape(3,3), columns = list('abc'), index
               = list('cde'))

df1 + df2

     a    b   c
c  0.0  2.0 NaN
d  5.0  7.0 NaN
e  NaN  NaN NaN

In [7]:
#If you notice, the same thing that happened in the series happened in the 
#dataframe
df1

   a  b
c  0  1
d  2  3

In [8]:
df2

   a  b  c
c  0  1  2
d  3  4  5
e  6  7  8

One method of adding dataframes together is to use the .add() function
This function adds the two dataframes together. if you add the fill_value() parameter, it would replace the Nan values for the indexes.

In [10]:
df1.add(df2, fill_value = 10)

      a     b     c
c   0.0   2.0  12.0
d   5.0   7.0  15.0
e  16.0  17.0  18.0

In [14]:
ser_c = df2.iloc[0]
ser_c

a    0
b    1
c    2
Name: c, dtype: int32

In [16]:
df2 - ser_c

   a  b  c
c  0  0  0
d  3  3  3
e  6  6  6

**RANKING AND SORTING OF ARRAYS**

In [22]:
q = Series([500, 600, 700, 350, 209, 560], index = list('acbdor'))
q

a    500
c    600
b    700
d    350
o    209
r    560
dtype: int64

In [23]:
q.sort_index() #rearranging of rows in ascending order, sort by index

a    500
b    700
c    600
d    350
o    209
r    560
dtype: int64

In [25]:
#notice how the index got sorted in ascending order:
#Now to sort by value:

q.sort_values()

o    209
d    350
a    500
r    560
c    600
b    700
dtype: int64

In [32]:
#ranking of series
d = Series(randn(4))
d

0    0.377855
1   -1.408563
2    1.701546
3    1.106206
dtype: float64

In [33]:
d.rank() #arranges the values in order of rank, the indexes are ranked

0    2.0
1    1.0
2    4.0
3    3.0
dtype: float64